//-------------------------------------------------------------------------*
//文件名: ATD.c 					                             	                   *
//说  明: 模/数转换模块驱动文件	  								                         *
//初始时间：  2012年06月30日              			           			           *
//修订记录：     		              			           				                 *
//备注：      适用于MC9S12XS128                         	                 *
//-------------------------------------------------------------------------*
#include "ATD.h"

//采样电压保存数组


//-------------------------------------------------------------------------*
//函数名: ATD_Init                                                  	     *
//功  能: 初始化ATD模块                                                    * 
//参  数: 无															                                 *
//返  回: 无                                                               *
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void ATDInit(void)
{
    ATD0CTL1 = 0b00100000;    //
    ATD1CTL1 = 0b00100000;    //
    //           ||||||||_____ETRIGCH0:  外部触发信号通道选择控制位
    //           |||||||______ETRIGCH1:
    //           ||||||_______ETRIGCH2:
    //           |||||________ETRIGCH3:
    //           ||||_________SMP_DIS:   ****采样前放电控制位**** 1=采样前放电;0=采样前不放电
    //           |||__________SRES0:     ****AD转换精度选择位****
    //           ||___________SRES1:     00 8位精度  01 10位精度 11 12位精度
    //           |____________ETRIGSEL:  外部触发选择位（暂未知） 
    
    ATD0CTL2 = 0b01000000;
    ATD1CTL2 = 0b01000000;     //
    //           ||||||||_____ACMPIE:    ATD比较中断使能位
    //           |||||||______ASCIE:     ATD转换序列结束中断使能位 1=允许
    //           ||||||_______ETRIGE:    外部触发允许位
    //           |||||________ETRIGP:    外部触发极性控制位
    //           ||||_________ETRIGLE:   外部触发电平/边沿控制位
    //           |||__________ICLKSTP:   停止模式内部时钟使能位
    //           ||___________AFFC:      ****ATD标志快速清除使能位**** 1=自动清除CCF位；0=软件清除CCF位
    //           |____________0
    
    ATD0CTL3 = 0b10001000;    //
    ATD1CTL3 = 0b10001000;    //
    //           ||||||||_____FRZ0:  背景冻结控制位
    //           |||||||______FRZ1
    //           ||||||_______FIFO:  结果寄存器先进先出模式控制位 转换映射问题
    //           |||||________S1C:   ****转换序列长度选择控制位****
    //           ||||_________S2C:   *单通道采样
    //           |||__________S4C:
    //           ||___________S8C:
    //           |____________DJM:   ****转换结果对齐方式控制位****  1=右对齐；0=左对齐  
    
    ATD0CTL4 = 0b00000011;    // 采样频率为5MHZ（0.28~8.3）   PRS = 3
    ATD1CTL4 = 0b00000011;    // 采样频率为5MHZ（0.28~8.3）   PRS = 3
    //           ||||||||_____PRS0:  ****A/D转换预分频设置控制位****  ATD采样周期
    //           |||||||______PRS1:  f(ATDCLK)=f(BUS)/[2*(PRS+1)]
    //           ||||||_______PRS2:
    //           |||||________PRS3:  
    //           ||||_________PRS4:
    //           |||__________SMP0:  采样时钟选择位 采样时间为N个ATD采样周期
    //           ||___________SMP1:  000  4  001  6  010  8  011 10    
    //           |____________SMP2:  100 12  101 16  110 20  111 24
    
    ATD0DIEN = 0b00000000;   //     禁止数字中断输入
    ATD1DIEN = 0b00000000;   //     禁止数字中断输入 
    //           ||||||||____IEN7   数字信号输入使能控制位
    //           |||||||_____IEN6   1  相应位数字信号输入禁止
    //           ||||||______IEN5   0  相应位数字信号输入使能
    //           |||||_______IEN4
    //           ||||________IEN3
    //           |||_________IEN2
    //           ||__________IEN1
    //           |___________IEN0  
    //ATD_CR5 = 0b00010000;    //
    //            ||||||||_____CA:    ****采样通道选择控制位****
    //            |||||||______CB:
    //            ||||||_______CC:
    //            |||||________CD:
    //            ||||_________MULT:  ****单/多通道A/D转换选择控制位****        1=多通道；0=单通道
    //            |||__________SCAN:  ****单次/连续A/D转换模式选择控制位****    1=连续转换；0=单次转换
    //            ||___________SC:    特殊通道转换控制位                1=特殊通道转换允许；0=特殊通道转换禁止
    //            |____________0
    //赋值的时候开始转换
    
}
//-------------------------------------------------------------------------*
//函数名: ATD_Read                                               	     *
//功  能: ATD模块采集电压                                                  * 
//参  数: nCh通道号码															                                 *
//返  回: 采样值                                                               *
//说  明: 采集到电压后并将其转化成对应的数值，比如：温度                   *
//-------------------------------------------------------------------------*
//多通道采样时，一定要注意，起始通道的采样值是存在ATD0DRL0，ATD0DRH0
//以此类推
   
uint16 ATDRead(uint8 nCh)
{
    if(nCh > 16)
      return 0;
    if(nCh < 8) {
       ATD0CTL5 = 0x10 | nCh;  //保险一点，都从0通道开始吧，这样可以保证一一对应
       while(ATD0STAT0_SCF == 0);  //等待通道转换结束   
       return (ATD0DR0H<<8) | ATD0DR0L;   //通道选择
    }
    else {
      
       ATD1CTL5 = 0x10 | (nCh - 8); 
       while(ATD1STAT0_SCF == 0);  //等待通道转换结束   
       return (ATD1DR0H<<8) | ATD1DR0L;   //通道选择
    }
}











































