//-------------------------------------------------------------------------*
//文件名: ATD.h 					                             	                   *
//说  明: 模/数转换模块驱动头文件	  								                       *
//初始时间：  2012年06月30日              			           			           *
//修订记录：     		              			           				                 *
//备注：      适用于MC9S12XS128                         	                 *
//-------------------------------------------------------------------------*
#ifndef _ATD_H_           //防止重复定义
#define _ATD_H_ 

//1、头文件    
#include "typedefine.h"           //类型别名定义
#include <MC9S12XET256.h>     /* derivative information */
#include <hidef.h> 

//4 函数声明
    //-----------------------------------------------------------------------*
    //函数名: SensorModuleInit                                                  	   *
    //功  能: 初始化ATD模块                                                  * 
    //参  数: 无															                               *
    //返  回: 无                                                             *
    //说  明: 无                                                             *
    //-----------------------------------------------------------------------*
     void ATDInit(void);

    //-------------------------------------------------------------------------*
    //函数名: Sampling_ATD                                               	     *
    //功  能: ATD模块采集电压                                                  * 
    //参  数: nCh通道号码															                                 *
    //返  回: 采样值                                                               *
    //说  明: 无                                                               *
    //-------------------------------------------------------------------------*
     uint16 ATDRead(uint8 nCh);    
        
#endif



