//-------------------------------------------------------------------------*
//文件名: ECT.c                                                        	   *
//说  明: 增强型捕捉定时器驱动文件                                       		     *
//初始时间：  2016年3月24日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XET256               			                       *
//-------------------------------------------------------------------------*
#include "ECT.h"

//-------------------------------------------------------------------------* 
//函数名: ECTInit                                                          *
//功  能: ECT初始化                                                        *
//参  数：无                                                               * 
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*  
void ECTInit(void){
    //定时器模块控制寄存器1
    ECT_TSCR1 = 0b00000000;   
    //            ||||||||____0:      
    //            |||||||_____0:      
    //            ||||||______0:   
    //            |||||_______0: 
    //            ||||________TFFCA: 定时器标志位快速清除选择位： 1 快速清除 0 普通清除
    //            |||_________TSFRZ: 背景调试模式下定时器停止控制位：  1 禁止 0 允许
    //            ||__________TSWAI: 等待模式下定时器工作控制位： 1 等待模式下禁止 0 等待模式下允许
    //            |___________TEN:   ********定时器使能位：  1 使能 0 禁止********
    
    //定时器模块控制寄存器2
    ECT_TSCR2 = 0b00000100;   //TCNT频率40/16= 2.5mhz,转速最大3000，最小600都能满足要求
    //            ||||||||____PR0:  预分频系数选择位      
    //            |||||||_____PR1:  000 001   001 002   010 004   011 008       
    //            ||||||______PR2:  100 016   101 032   110 064   111 128   
    //            |||||_______TCRE: 定时计数器复位允许位 1 允许 0 禁止复位 
    //            ||||________0:
    //            |||_________0:
    //            ||__________0:
    //            |___________TOI:  定时器溢出中断使能位    1 允许 0 禁止
      
    //IC/OC功能选择位
    ECT_TIOS = 0b00000000;   
    //           ||||||||_____IOS0:   设置输入捕捉和输出比较通道  输入捕捉
    //           |||||||______IOS1:   1  相应的通道工作为 输出比较 
    //           ||||||_______IOS2:   0  相应的通道工作为 输入捕捉   
    //           |||||________IOS3:   PT0--->speed
    //           ||||_________IOS4:   
    //           |||__________IOS5: 
    //           ||___________IOS6:
    //           |____________IOS7: 
    
    //定时器控制寄存器1(输出比较)
    ECT_TCTL1 = 0b00000000;   
    //            ||||||||____OL4:      OMn     OLn     通道匹配时的动作  
    //            |||||||_____OM4:       0       0      定时器与输出引脚断开
    //            ||||||______OL5:       0       1      OCn输出翻转   
    //            |||||_______OM5:       1       0      OCn输出清零 
    //            ||||________OL6:       1       1      OCn输出置1
    //            |||_________OM6: 
    //            ||__________OL7:
    //            |___________OM7: 
    
    //定时器控制寄存器2(输出比较)
    ECT_TCTL2 = 0b00000000;   
    //            ||||||||____OL0:  
    //            |||||||_____OM0:  
    //            ||||||______OL1:   
    //            |||||_______OM1: 
    //            ||||________OL2:
    //            |||_________OM2: 
    //            ||__________OL3:
    //            |___________OM3: 
    
    //定时器控制寄存器3(输入捕捉)
    ECT_TCTL3 = 0b00000000;    
    //            ||||||||____EDG4A:     EDGnB    EDGnA   边沿检测器工作方式  
    //            |||||||_____EDG4B:       0        0         捕捉禁止
    //            ||||||______EDG5A:       0        1         捕捉上升沿   
    //            |||||_______EDG5B:       1        0         捕捉下降沿 
    //            ||||________EDG6A:       1        1         上升、下降沿均捕捉
    //            |||_________EDG6B: 
    //            ||__________EDG7A:
    //            |___________EDG7B: 
    
    //定时器控制寄存器4(输入捕捉)
    ECT_TCTL4 = 0b00000001;   
    //            ||||||||____EDG0A:       0        1         PT0捕捉上升沿 
    //            |||||||_____EDG0B:  
    //            ||||||______EDG1A:   
    //            |||||_______EDG1B: 
    //            ||||________EDG2A:
    //            |||_________EDG2B: 
    //            ||__________EDG3A:
    //            |___________EDG3B: 
    
    //定时器中断使能寄存器
    ECT_TIE = 0b00000001;   
    //          ||||||||______C0I:   IC0  1 中断使能 0 中断屏蔽      
    //          |||||||_______C1I:        
    //          ||||||________C2I:   
    //          |||||_________C3I: 
    //          ||||__________C4I:
    //          |||___________C5I:
    //          ||____________C6I:
    //          |_____________C7I: 
    
    //定时器中断标志寄存器1
    ECT_TFLG1 = 0b00000001;   
    //            ||||||||____C0F:      1 表示该通道有中断发生
    //            |||||||_____C1F:      清除中断标志位是向该位写1
    //            ||||||______C2F:   
    //            |||||_______C3F: 
    //            ||||________C4F:
    //            |||_________C5F:
    //            ||__________C6F:
    //            |___________C7F:
    
    //定时器中断标志寄存器2
    ECT_TFLG2 = 0b00000000;   
    //            ||||||||____0:      
    //            |||||||_____0:      
    //            ||||||______0:   
    //            |||||_______0: 
    //            ||||________0:
    //            |||_________0:
    //            ||__________0:
    //            |___________TOF:    自由定时器溢出标志位 写1清除  
    
    //定时器计数寄存器 TCNT  按字访问 16位  
    //IC/OC 16位寄存器 TCn   IC方式下用于锁存自由计数器的值     OC方式下用于设置输出比较匹配值  
                           
}



