//-------------------------------------------------------------------------*
//文件名: ECT.c                                                        	   *
//说  明: 增强型捕捉定时器驱动文件                                       		     *
//初始时间：  2016年3月24日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XET256               			                       *
//-------------------------------------------------------------------------*
#include "ECT.h"

//-------------------------------------------------------------------------* 
//函数名: ECTInit                                                          *
//功  能: ECT初始化                                                        *
//参  数：无                                                               * 
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*  
void ECTInit(void){
    //定时器模块控制寄存器1
    /*ECT_TSCR1 = 0b00000000;   
    ECT_TSCR2 = 0b00000100;   //TCNT频率40/16= 2.5mhz,转速最大3000，最小600都能满足要求
    ECT_TIOS = 0b00000000;   
    ECT_TCTL1 = 0b00000000;   
    ECT_TCTL2 = 0b00000000;   
    ECT_TCTL3 = 0b00000000;    
    ECT_TCTL4 = 0b00000001;   
    ECT_TIE = 0b00000001;   
    ECT_TFLG1 = 0b00000001;   
    ECT_TFLG2 = 0b00000000;  */
    //ECT_TSCR1_TFFCA = 1;  // 定时器标志位快速清除
  ECT_TSCR1_TEN = 1;    // 定时器使能位. 1=允许定时器正常工作; 0=使主定时器不起作用(包括计数器)
  ECT_TIOS  = 0xf0;     // 1 2 3 4 IC    5 6 7 8 OC
  ECT_TCTL1 = 0x00;	    // 后四个通道设置为定时器与输出引脚断开
  ECT_TCTL2 = 0x00;     // 前四个通道设置为定时器与输出引脚断开
  ECT_TCTL3 = 0b00000000;    
  ECT_TCTL4 = 0b00001010;//IC0 IC1只 捕捉下降沿
  ECT_DLYCT = 0x00;	    // 延迟控制功能禁止
  ECT_ICOVW = 0x00;	    // 对应的寄存器允许被覆盖;  NOVWx = 1, 对应的寄存器不允许覆盖
  ECT_ICSYS = 0x00;	    // 禁止IC及PAC的保持寄存器
  ECT_TIE   = 0x03;     // 开1、0中断
  ECT_TSCR2 = 0x04;	    // 预分频系数pr2-pr0:100,时钟周期为0.4us,使能定时器溢出中断
  ECT_TFLG1 = 0xff;	    // 清除各IC/OC中断标志位
  ECT_TFLG2 = 0xff;     // 清除自由定时器中断标志位
}
/************************************************************/
/*                    初始化ECT模块                         */
/************************************************************
void initialize_ect(void){
  //ECT_TSCR1_TFFCA = 1;  // 定时器标志位快速清除
  ECT_TSCR1_TEN = 1;    // 定时器使能位. 1=允许定时器正常工作; 0=使主定时器不起作用(包括计数器)
  ECT_TIOS  = 0xf0;     // 1 2 3 4 IC    5 6 7 8 OC
  ECT_TCTL1 = 0x00;	    // 后四个通道设置为定时器与输出引脚断开
  ECT_TCTL2 = 0x00;     // 前四个通道设置为定时器与输出引脚断开
  ECT_TCTL3 = 0b00000000;    
  ECT_TCTL4 = 0b00000101;//IC0 IC1只 捕捉上升沿
  ECT_DLYCT = 0x00;	    // 延迟控制功能禁止
  ECT_ICOVW = 0x00;	    // 对应的寄存器允许被覆盖;  NOVWx = 1, 对应的寄存器不允许覆盖
  ECT_ICSYS = 0x00;	    // 禁止IC及PAC的保持寄存器
  ECT_TIE   = 0x43;     // 开6、0中断
  ECT_TSCR2 = 0x04;	    // 预分频系数pr2-pr0:100,时钟周期为0.4us,使能定时器溢出中断
  ECT_TFLG1 = 0xff;	    // 清除各IC/OC中断标志位
  ECT_TFLG2 = 0xff;     // 清除自由定时器中断标志位
}                            */


