//-------------------------------------------------------------------------*
//文件名: GeneralFun.h (通用函数头文件)                               	   *
//说  明: 通用函数头文件						                                       *
//初始时间：  2012年07月02日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XS128               			                       *
//-------------------------------------------------------------------------*

#ifndef GENERALFUN_H                                       //防止重复定义
#define GENERALFUN_H

    /* 1 头文件 */
#include "typedefine.h"                                   //类型定义头文件
	
    //2 位操作
        #define BSET(bit,Register) ((Register)|= (1<<(bit)))   //设置寄存器中某一位为1
        #define BCLR(bit,Register) ((Register) &= ~(1<<(bit))) //设置寄存器中某一位为0 
        #define BGET(bit,Register) (((Register) >> (bit)) & 1) //得到寄存器中某一位状态
	
    /* 3 函数声明 */
        void DelayUs(UINT16 count);                              //延时
        
//-------------------------------------------------------------------------*
// 函数名: Delay_Ms()                                                      *
// 功  能: 延时                                                            *
// 参  数: count(小于65535)                                                *
// 返  回: 无                                                              *
// 说  明: 无                                                              *
//-------------------------------------------------------------------------*
        void DelayMs(UINT16 count);
      
 #endif

