//-------------------------------------------------------------------------*
//文件名: PIT.h                                                        	   *
//说  明: 周期性中断定时器头文件                                         		   *
//初始时间：  2012年07月02日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XS128               			                       *
//-------------------------------------------------------------------------*
#ifndef _PIT_H
#define _PIT_H

//1 头文件
#include "typedefine.h"           //类型别名定义
#include <MC9S12XET256.h>     /* derivative information */
#include <hidef.h> 

//-------------------------------------------------------------------------* 
//函数名: PIT_Init                                                         *
//功  能: 周期中断定时器初始化                                             *
//参  数: 无                                                               *
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*  
void PITInit(void);

void PITSetCycle(uint8 nCh,uint16 nUs);

//-------------------------------------------------------------------------* 

#define StartSystemTimer() ( PITCE_PCE0 = 1)     //enable timer channel 0 

#endif