//-------------------------------------------------------------------------*
//文件名: MCUInit.h                                                    	   *
//说  明: 芯片初始化头文件                                         		     *
//初始时间：  2012年07月01日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XS128               			                       *
//-------------------------------------------------------------------------*
#ifndef _PLL_H_
#define _PLL_H_

//1 头文件
#include "typedefine.h"           //类型别名定义
#include <MC9S12XET256.h>     /* derivative information */


//3 函数声明
//-------------------------------------------------------------------------* 
//函数名: PLL_Init                                                         *
//功  能: 锁相环初始化                                                     *
//参  数：无                                                               * 
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------* 
void PLLInit(void); 
#endif