//-------------------------------------------------------------------------*
//文件名: PWM.c                                                        	   *
//说  明: PWM脉冲输出文件                                         		     *
//初始时间：  2012年07月02日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XS128               			                       *
//-------------------------------------------------------------------------*
#include "PWM.h"

//-------------------------------------------------------------------------* 
//函数名: PWM_Init                                                         *
//功  能: PWM初始化                                                        *
//参  数：无                                                               * 
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*  
void PWMInit(void){
    //PWM启动寄存器
    PWME = 0b00000000;
    //       ||||||||______PWME0:   1 启动相应通道的PWM输出，下一个时钟开始输出PWM
    //       |||||||_______PWME1:   0 关闭相应通道的PWM输出
    //       ||||||________PWME2:
    //       |||||_________PWME3:
    //       ||||__________PWME4:
    //       |||___________PWME5:
    //       ||____________PWME6:
    //       |_____________PWME7:
  
    //PWM时钟选择寄存器
    PWMCLK = 0b00000000;            
    //         ||||||||____PCLK0:  0 选择ClockX(A,B)    
    //         |||||||_____PCLK1:  1 选择ClockSx(A,B)
    //         ||||||______PCLK2:  通道0,1,4,5下 X = A     4
    //         |||||_______PCLK3:  通道2,3,6,7下 X = B
    //         ||||________PCLK4:
    //         |||_________PCLK5:
    //         ||__________PCLK6:
    //         |___________PCLK7:
    
    //PWM预分频寄存器
    PWMPRCLK = 0b00100010; //总线40M ClockA = 10M ClockB = 10MHZ      
    //           ||||||||__PCKA0:  ClockA预分频控制位  ClockB预分频控制位   
    //           |||||||___PCKA1:  000 000分频 
    //           ||||||____PCKA2:  001 002分频   
    //           |||||_____0:      010 004分频 
    //           ||||______PCKB0:  011 008分频   
    //           |||_______PCKB1:  100 016分频 
    //           ||________PCKB2:  101 032分频 
    //           |_________0:      110 064分频    111 128分频 
    
    //PWM分频寄存器A                     
//  PWMSCLA = 0b01111101;          
    //          ||||||||___Bit0:    ClockSA=ClockA/(2xPWMSCLA)    
    //          |||||||____Bit1:    125
    //          ||||||_____Bit2:    
    //          |||||______Bit3:     
    //          ||||_______Bit4:     
    //          |||________Bit5:  
    //          ||_________Bit6:  
    //          |__________Bit7: 
    //PWMSCLA = 25;           //ClockSA = 200K   
    
    //PWM分频寄存器B                        
//  PWMSCLB = 0b00000001;          
    //          ||||||||___Bit0:    ClockSB=ClockB/(2xPWMSCLB)    
    //          |||||||____Bit1:  
    //          ||||||_____Bit2:    
    //          |||||______Bit3:     
    //          ||||_______Bit4:     
    //          |||________Bit5:  
    //          ||_________Bit6:  
    //          |__________Bit7: 
    //PWMSCLB = 75;         //ClockSB = 20KHZ
                              
    //PWM极性选择寄存器
    PWMPOL = 0b11111111;         
    //         ||||||||____PPOL0:    1 周期开始PWM输出为高电平    
    //         |||||||_____PPOL1:    0 周期开始PWM输出为低电平 
    //         ||||||______PPOL2:    
    //         |||||_______PPOL3:     
    //         ||||________PPOL4:     
    //         |||_________PPOL5:  
    //         ||__________PPOL6:  
    //         |___________PPOL7: 
    

    //PWM波形对齐寄存器
    PWMCAE = 0b00000000;          
    //         ||||||||____CAE0:    1 相应通道PWM输出中心对齐    
    //         |||||||_____CAE1:    0 相应通道PWM输出左对齐
    //         ||||||______CAE2:    
    //         |||||_______CAE3:     
    //         ||||________CAE4:     
    //         |||_________CAE5:  
    //         ||__________CAE6:  
    //         |___________CAE7: 
    
    //PWM控制寄存器
    PWMCTL = 0b00000000;        
    //         ||||||||____0:        
    //         |||||||_____0:    
    //         ||||||______PFRZ:    冻结模式下PWM计数禁止控制位 0 允许 1 禁止    
    //         |||||_______PSWAI:   等待模式下的PWM控制位 0 允许输入时钟到预分频器 1 禁止     
    //         ||||________CON01:   通道0、1级联控制位 0 不级联  1 级联   PWMCNT01 PWMPER01 PWMDTY01     
    //         |||_________CON23:   通道2、3级联控制位 0 不级联  1 级联
    //         ||__________CON45:   通道4、5级联控制位 0 不级联  1 级联
    //         |___________CON67:   通道6、7级联控制位 0 不级联  1 级联      
                        
//  PWM关闭寄存器
//  PWMSDN = 0b00000000 
    //         ||||||||____PWM7ENA: PWM紧急关闭使能控制位(PTP7作为触发脚)       
    //         |||||||_____PWM7INL: 通道7出发方式选择位   
    //         ||||||______PWM7IN:  通道7当前状态位    
    //         |||||_______0:        
    //         ||||________PWMLVL:  PWM关闭后各通道输出电平选择位     
    //         |||_________PWMRSTRT:再次启动PWM控制位
    //         ||__________PWMIE:   PWM中断使能控制位
    //         |___________PWMIF:   PWM中断标志位   
                              
    //PWM通道周期寄存器
    //PWMCNTX PWM通道计数寄存器 
    //PWMDTYX PWM通道占空比寄存器
    //PWMSDN PWM关闭寄存器                              
}

//-------------------------------------------------------------------------* 
//函数名: PWMOutput                                                        *
//功  能: 启动PWM模块                                                      *
//参  数: 无                                                               *
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
static uint8 *pPWMPERn[8] = {&PWMPER0,&PWMPER1,&PWMPER2,&PWMPER3,&PWMPER4,&PWMPER5,&PWMPER6,&PWMPER7};
static uint8 *pPWMDTYn[8] = {&PWMDTY0,&PWMDTY1,&PWMDTY2,&PWMDTY3,&PWMDTY4,&PWMDTY5,&PWMDTY6,&PWMDTY7};
  
void PWMOutput(uint8 nCh,uint8 nCycle,uint8 nWide){
    if(nCh > 7)
      return;
    if(nCycle == 0 || nWide == 0) {
      PWME &= 0xff^(0x01 << nCh);
      return;
    }
    *pPWMPERn[nCh] = nCycle; 
    *pPWMDTYn[nCh] = nWide;
    //使能相应的PWM控制位
    PWME |= (0x01 << nCh);   
}
