//-------------------------------------------------------------------------*
//文件名: PWM.h                                                        	   *
//说  明: PWM脉冲输出头文件                                         		   *
//初始时间：  2012年07月02日              			                           *
//修订记录：     		              			                                   *
//备注：      适用于MC9S12XS128               			                       *
//-------------------------------------------------------------------------*
#ifndef _PWM_H
#define _PWM_H

//1 头文件
#include "typedefine.h"           //类型别名定义
#include <hidef.h>      /* common defines and macros */
#include <MC9S12XET256.h>     /* derivative information */
//-------------------------------------------------------------------------* 
//函数名: PWM_Init                                                         *
//功  能: PWM初始化                                                        *
//参  数: 无                                                               *
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*  
void PWMInit(void);

//-------------------------------------------------------------------------* 
//函数名: PWMOutput                                                       *
//功  能: 启动PWM模块                                                      *
//参  数: 无                                                               *
//返  回: 无                                                               * 
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void PWMOutput(uint8 nCh,uint8 nCycle,uint8 nWide);  

#endif